package com.decision.backend.model;

import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.ToString;

@Getter
@AllArgsConstructor
@ToString
public enum Risks {

    OR111(1, "OR111", "运动员的身高不占优势"),
    OR112(2, "OR112", "运动员的身高、体重比例不占优势"),
    OR121(3, "OR121", "运动员的先天肢体协调性较差"),
    OR131(4, "OR131", "运动员的生理机能较他人更易损伤"),
    OR132(5, "OR132", "运动员的心肺功能相关指标不占优势"),
    OR141(6, "OR141", "运动员的抗压能力差，不能及时地自我调节"),
    OR142(7, "OR142", "运动员的训练欲望不强"),
    OR143(8, "OR143", "运动员的训练情绪不稳定"),
    OR211(9, "OR211", "运动员的身体素质结构发展不符合项目特征"),
    OR212(10, "OR212", "运动员的专项身体素质较差"),
    OR221(11, "OR221", "运动员的技术不稳定"),
    OR222(12, "OR222", "运动员的技术个性特征不显著，没有“绝杀”技术"),
    OR223(13, "OR223", "运动员有明显的、不可弥补的技术缺陷"),
    OR231(14, "OR231", "运动员对对手的战术应变能力不强"),
    OR232(15, "OR232", "运动员对战术制定及战术训练没有良好地针对意识"),
    OR233(16, "OR233", "运动员的战术单一"),
    OR241(17, "OR241", "运动员不能较好地掌握相关理论与知识"),
    OR242(18, "OR242", "运动员不能主动学习理论知识"),
    OR251(19, "OR251", "运动员旧伤积累不得痊愈"),
    OR252(20, "OR252", "运动员因意外事故造成损伤"),
    OR261(21, "OR261", "运动员没有正确的道德观念"),
    OR262(22, "OR262", "运动员缺乏爱国主义精神"),
    OR263(23, "OR263", "运动员不能较好的践行体育道德"),
    OR264(24, "OR264", "运动员追求目标不明确"),
    OR265(25, "OR265", "运动员缺少追求卓越的信念"),
    OR271(26, "OR271", "运动员独立自主能力较差"),
    OR272(27, "OR272", "运动员不能较好地管理自己的言行"),
    OR281(28, "OR281", "运动员的赛练比例失调导致比赛经验不足"),
    SR111(29, "SR111", "社会大众对网球文化不认同"),
    SR121(30, "SR121", "网球文化传播渠道狭窄"),
    SR211(31, "SR211", "运动员选拔指标不科学"),
    SR212(32, "SR212", "运动员参加外训的机会不公平"),
    SR213(33, "SR213", "运动员参赛管理制度不符合职业网球需求"),
    SR214(34, "SR214", "有无编制使运动员待遇差距较大"),
    SR221(35, "SR221", "运动员升学问题得不到良好解决"),
    SR222(36, "SR222", "运动员学、训问题得不到良好处理"),
    SR231(37, "SR231", "教练员绩效考核指标不科学"),
    SR232(38, "SR232", "教练员考核方式单一"),
    SR233(39, "SR233", "有无编制使教练员待遇差距较大"),
    SR241(40, "SR241", "硬件设施得不到有效利用"),
    SR242(41, "SR242", "场地与器材的维护滞后"),
    SR311(42, "SR311", "经费不能满足运动员的赛、练需求"),
    SR312(43, "SR312", "经费的分配不合理"),
    SR321(44, "SR321", "高科技技术与设备匮乏"),
    SR322(45, "SR322", "高科技技术与设备得不到善用"),
    SR331(46, "SR331", "场地与器材不能满足运动员需求"),
    SR341(47, "SR341", "运动员的医疗保障不得力"),
    SR411(48, "SR411", "训练计划的制定不科学，有给运动员带来损伤的潜在危险"),
    SR412(49, "SR412", "教练员沟通能力不足"),
    SR413(50, "SR413", "教练员专项知识储备较少，不能理论指导实践"),
    SR414(51, "SR414", "训练计划不能够体现运动员个性特征和较强的针对性，不利于运动员竞技能力的提升"),
    SR415(52, "SR415", "教练员没有较强的事业心和责任心"),
    SR416(53, "SR416", "教练员对运动员的行为没有约束或及时监管"),
    SR417(54, "SR417", "教练员对运动员长远发展的宏观把控力不强"),
    SR418(55, "SR418", "教练员没有较强的职业道德水平"),
    SR421(56, "SR421", "家长（监护人）对运动员期望过高造成运动员心理负担加重"),
    SR422(57, "SR422", "家长（监护人）对运动员的赛、练不支持、不在意"),
    SR431(58, "SR431", "运动员与教练员关系处理不当"),
    SR432(59, "SR432", "运动员与资助方关系处理不当"),

    ;

    private final int index;
    private final String code;
    private final String detail;
}
